app/controllers/post_controller.rb

INSERT INTO "posts" ("contents", "created_at", "updated_at") VALUES ('"Hello"', '2025-01-02 06:51:32.543164', '2025-01-02 06:51:32.543164') RETURNING "id"
---
    def create
        new_post = Post.create(contents: params[:contents])